-- phpMyAdmin SQL Dump
-- version 4.3.11.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Oct 14, 2015 at 05:57 AM
-- Server version: 5.5.31
-- PHP Version: 5.5.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `u6272334_mcu`
--

-- --------------------------------------------------------

--
-- Table structure for table `lp_ads`
--

CREATE TABLE IF NOT EXISTS `lp_ads` (
  `id` int(11) NOT NULL COMMENT 'id เก็บลำดับการเพิ่มข้อมูล',
  `image` varchar(255) NOT NULL COMMENT 'เก็บชื่อไฟล์รูปภาพที่อัพโหลด',
  `name` varchar(255) NOT NULL COMMENT 'เก็บชื่อโฆษราหรือประกาศ',
  `detail` text NOT NULL COMMENT 'เก็บรายละเอียดของประกาศนั้นๆ',
  `link_url` text NOT NULL COMMENT 'เก็บลิ้งเชื่อมโยงไปยังหน้าประกาศ',
  `show_ad` enum('0','1') NOT NULL COMMENT 'เก็บข้อมูลว่าแสดงผลประกาศนี้หรือไม่',
  `position` enum('0','1','2') NOT NULL COMMENT 'เก็บข้อมูลตำแหน่งของประกาศ'
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บโฆษณาของเว็บที่ประกาศให้ลูกค้าทราบ';

--
-- Dumping data for table `lp_ads`
--

INSERT INTO `lp_ads` (`id`, `image`, `name`, `detail`, `link_url`, `show_ad`, `position`) VALUES
(2, '2y8by6xdj5s0gksg4.jpg', 'รับออกแบบ PCB แบบหน้าเดียวหรือสองหน้า', 'รับออกแบบ PCB แบบหน้าเดียวหรือสองหน้าครับ ใช้โปรแกรม Protel 99 ราคาเริ่มต้นที่ 100 บาท จะขึ้น อยู่กับความยากง่ายและจำนวนอุปกรณ์ครับหากท่าน มีวงจรมาให้ราคาของการออกแบบจะลดลงมาครับ', 'http://demo.lnwphp.in.th/mcuthailand/page-1@ทดสอบหน้าเว็บ.html', '0', '0'),
(3, 'wey0r8pi3v48c0w88c.jpg', 'รับทำโปรเจคนักศึกษาครับ ราคาไม่แพง', 'รับทำโปรเจคนักศึกษาครับ ราคาไม่แพงครับ เมื่อ\nงานเสร็จจะมีการสอนการทำงานของโปรแกรมแบบ\nละเอียดครับ พร้อมกับข้อมูลของโปรเจคนั้นให้ครับ\nเพื่อสะดวกในการจัดทำรูปเล่ม โดยพัฒนาด้วยไม\nโครคอนโทรลเลอร์ ตระกูล MCS-51, AVR, PIC,\nARM และงานด้านฐานข้อมูลใช้ Visaul Basic 6 \nเช่น ระบบจอดรถด้วย RFID โดยเก็บข้อมูลลงฐาน\nข้อมูล ระบบเข้าออกสแกนลายนิ้วมือ ด้วย Finger print เก็บข้อมูลพนักงานลงฐานข้อมูล เป็นต้น', 'http://demo.lnwphp.in.th/mcuthailand/page-2@เมนูเว็บที่2.html', '0', '0'),
(4, 'kn8ixb0uh9ckkwg4so.jpg', 'รับออกแบบทำกล่อง PVC ใช้ CNC ราคาไม่แพง', 'รับออกแบบทำกล่อง PVC ใช้ CNC ราคาไม่แพงครับ โดยติดต่อสอบ ถามรายละเอียดได้ทางโทรศัพท์ หรือทางอีเมลด้านล่างครับ สนใจสอบถามที่เบอร์ \n     083-8224023 \n     all-mcuprojects@hotmail.com', 'http://demo.lnwphp.in.th/mcuthailand/page-3@หน้าเว็บ.html', '0', '1'),
(5, '1eafzpsu9r0g0s0oc0.jpg', 'รับออกแบบและรับทำโครงสร้าง หุ่นยนต์', 'รับออกแบบและรับทำโครงสร้าง\nหุ่นยนต์ โดยตัวโครงหุ่นยนต์ \nใช้วัสดุขึ้นอยู่กับความต้องการ\nของลูกค้า ซึ่งอาจจะเป็นอลูมิเนียม หรือไฟเบอร์กราสเพื่อความสวย\nงาม โดยสามารถสอบถามรายละ\nเอียดได้ทางโทรศัพท์หรือทางอี\nเมลด้านล่างครับ', 'http://demo.lnwphp.in.th/mcuthailand/page-4@เพิ่มหน้าเว็บ.html', '0', '1'),
(6, 'ovch6323ntcc0c0csc.jpg', 'รับทำเครื่องเล่นต่างๆ ใช้จัดงาน Even', 'รับทำเครื่องเล่นต่างๆ ใช้จัดงาน Even คิดราคาตามความยากง่ายของงาน ระยะเวลาที่ใช้ทำ หากสนใจสามารถติดต่อสอบถามราคาหรือสอบถามรายละ\nเอียดต่างๆ ได้ทาง E-mail หรือ MSN \n\n     E-mail : all-mcuprojects@hotmail.com Tel : 083-8224023 (คุณ อภิชาติ)', 'http://demo.lnwphp.in.th/mcuthailand/contact-ติดต่อ@ติดต่อเรา.html', '0', '2'),
(7, 'dco0szmsb484w0wko.jpg', 'ทดสอบบบ', 'ทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบทดสอบบบ', 'http://demo.lnwphp.in.th/mcuthailand/', '0', '0'),
(8, 'ovch6323ntcc0c0csc.jpg', 'รับทำเครื่องเล่นต่างๆ ใช้จัดงาน Even', 'รับทำเครื่องเล่นต่างๆ ใช้จัดงาน Even คิดราคาตามความยากง่ายของงาน ระยะเวลาที่ใช้ทำ หากสนใจสามารถติดต่อสอบถามราคาหรือสอบถามรายละ\r\nเอียดต่างๆ ได้ทาง E-mail หรือ MSN \r\n\r\n     E-mail : all-mcuprojects@hotmail.com Tel : 083-8224023 (คุณ อภิชาติ)', '', '0', '2'),
(9, '1eafzpsu9r0g0s0oc0.jpg', 'รับออกแบบและรับทำโครงสร้าง หุ่นยนต์', 'รับออกแบบและรับทำโครงสร้าง\r\nหุ่นยนต์ โดยตัวโครงหุ่นยนต์ \r\nใช้วัสดุขึ้นอยู่กับความต้องการ\r\nของลูกค้า ซึ่งอาจจะเป็นอลูมิเนียม หรือไฟเบอร์กราสเพื่อความสวย\r\nงาม โดยสามารถสอบถามรายละ\r\nเอียดได้ทางโทรศัพท์หรือทางอี\r\nเมลด้านล่างครับ', 'http://www.mcuthailand.com/mechanic/robot.html', '0', '2'),
(10, 'wey0r8pi3v48c0w88c.jpg', 'รับทำโปรเจคนักศึกษาครับ ราคาไม่แพง', 'รับทำโปรเจคนักศึกษาครับ ราคาไม่แพงครับ เมื่อ\r\nงานเสร็จจะมีการสอนการทำงานของโปรแกรมแบบ\r\nละเอียดครับ พร้อมกับข้อมูลของโปรเจคนั้นให้ครับ\r\nเพื่อสะดวกในการจัดทำรูปเล่ม โดยพัฒนาด้วยไม\r\nโครคอนโทรลเลอร์ ตระกูล MCS-51, AVR, PIC,\r\nARM และงานด้านฐานข้อมูลใช้ Visaul Basic 6 \r\nเช่น ระบบจอดรถด้วย RFID โดยเก็บข้อมูลลงฐาน\r\nข้อมูล ระบบเข้าออกสแกนลายนิ้วมือ ด้วย Finger print เก็บข้อมูลพนักงานลงฐานข้อมูล เป็นต้น', 'http://www.mcuthailand.com/project.html', '0', '2'),
(11, 'ovch6323ntcc0c0csc.jpg', 'รับทำเครื่องเล่นต่างๆ ใช้จัดงาน Even', 'รับทำเครื่องเล่นต่างๆ ใช้จัดงาน Even คิดราคาตามความยากง่ายของงาน ระยะเวลาที่ใช้ทำ หากสนใจสามารถติดต่อสอบถามราคาหรือสอบถามรายละ\r\nเอียดต่างๆ ได้ทาง E-mail หรือ MSN \r\n\r\n     E-mail : all-mcuprojects@hotmail.com Tel : 083-8224023 (คุณ อภิชาติ)', '', '0', '1'),
(12, '2y8by6xdj5s0gksg4.jpg', 'รับออกแบบ PCB แบบหน้าเดียวหรือสองหน้า', 'รับออกแบบ PCB แบบหน้าเดียวหรือสองหน้าครับ ใช้โปรแกรม Protel 99 ราคาเริ่มต้นที่ 100 บาท จะขึ้น อยู่กับความยากง่ายและจำนวนอุปกรณ์ครับหากท่าน มีวงจรมาให้ราคาของการออกแบบจะลดลงมาครับ', 'http://www.mcuthailand.com/pcb_design.html', '0', '1');

-- --------------------------------------------------------

--
-- Table structure for table `lp_event`
--

CREATE TABLE IF NOT EXISTS `lp_event` (
  `id` int(11) NOT NULL COMMENT 'เก็บลำดับการเพิ่่มข้อมูล',
  `images` varchar(255) NOT NULL COMMENT 'เก็บชื่อรูปภาพที่อัพโหลดไว้',
  `show_event` enum('0','1') NOT NULL COMMENT 'เก็บข้อมูลว่าจะให้แสดงผลหรือไม่',
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8 COMMENT='รูปภาพ Event ต่างๆที่ทางเจ้าของเว็บไปร่วมงานหรือจัดขึ้นมา';

--
-- Dumping data for table `lp_event`
--

INSERT INTO `lp_event` (`id`, `images`, `show_event`, `name`) VALUES
(1, '1f5v378h121wscws0w.jpg', '0', 'test'),
(2, 'pjbqho5ckzkw0gs4c.jpg', '0', ''),
(3, 'x8d4gfdwyjkkswsso8.jpg', '0', ''),
(4, '1ghi4xxnq3k0so8wws.jpg', '0', ''),
(5, 'q6gtz9phju8o88ww0.jpg', '0', ''),
(6, 'iamr97uhqb4s8gs0o8.jpg', '0', ''),
(7, 'payd9a3y10ggck8s.jpg', '0', ''),
(8, '2wfx2ulbb2g400gcsk.jpg', '0', ''),
(9, '1r3lub30nrms8wk4cs.jpg', '0', '');

-- --------------------------------------------------------

--
-- Table structure for table `lp_mail`
--

CREATE TABLE IF NOT EXISTS `lp_mail` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `subject` varchar(255) NOT NULL,
  `text` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บข้อมูลการติดต่อที่ลูกค้าส่งมา';

--
-- Dumping data for table `lp_mail`
--

INSERT INTO `lp_mail` (`id`, `name`, `email`, `subject`, `text`) VALUES
(1, 'เบ้น', 'benzbenz900@gmail.com', 'ทดสอบ', '<p>ทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบทดสอบบบบบ</p>'),
(2, 'ธนชิต สิทธิกัน', 'benzbenz900@gmail.com', 'ทดสอบทดสอบ', 'ทดสอบทดสอบทดสอบหหหอ ทดสอบทดสอบทดสอบ ทดสอบทดสอบทดสอบทดสอบทดสอบ');

-- --------------------------------------------------------

--
-- Table structure for table `lp_news`
--

CREATE TABLE IF NOT EXISTS `lp_news` (
  `id` int(11) NOT NULL,
  `name_page` varchar(255) NOT NULL,
  `keyword` text NOT NULL,
  `description` text NOT NULL,
  `detail_page` longtext NOT NULL,
  `image` varchar(255) NOT NULL,
  `date_time_post` datetime NOT NULL,
  `view_total` int(11) NOT NULL,
  `show_news` enum('0','1') NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='ข่าวสารของเว็บหรือประกาศสำคัญต่างๆ';

--
-- Dumping data for table `lp_news`
--

INSERT INTO `lp_news` (`id`, `name_page`, `keyword`, `description`, `detail_page`, `image`, `date_time_post`, `view_total`, `show_news`) VALUES
(1, 'ทดสอบข่าวสาร', 'ไม่จำเป็น', 'รายละเอียด', '<p>รายการต่างๆทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสาร</p>', '2azzp17fqukgwosw4k.jpg', '2015-09-30 10:35:00', 0, '0'),
(2, 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', '<p>ทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสาร</p>', 'utiekyynubkw8k8oo.jpg', '2015-10-03 10:46:15', 0, '0'),
(3, 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', '<p>ทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสาร</p>', '34tb1jiv0ssgok4s4o.jpg', '2015-10-03 10:46:49', 0, '0'),
(4, 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', '<p>ทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสาร</p>', '9ybnyfgo9rcook04k.jpg', '2015-10-03 10:47:13', 0, '0'),
(5, 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', '<p>ทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสาร</p>', '1ltplei7c15w4k88ks.jpg', '2015-10-03 10:50:33', 0, '0'),
(6, 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', 'ทดสอบข่าวสาร', '<p>ทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสารทดสอบข่าวสาร</p>', 'fq34c6lch5448oosk.jpg', '2015-10-03 10:50:49', 0, '0'),
(7, 'asdasda', 'sdasdas', 'asdasdas', '<p>asdasdasdasdasdasdasd</p>', '1moeypymzx7o4s0os8.jpg', '2015-10-03 18:14:30', 0, '0');

-- --------------------------------------------------------

--
-- Table structure for table `lp_page`
--

CREATE TABLE IF NOT EXISTS `lp_page` (
  `id` int(11) NOT NULL,
  `name_page` varchar(255) NOT NULL,
  `keyword` text NOT NULL,
  `description` text NOT NULL,
  `detail_page` longtext NOT NULL,
  `url_link` text NOT NULL,
  `gallery_1` varchar(255) NOT NULL,
  `gallery_2` varchar(255) NOT NULL,
  `gallery_3` varchar(255) NOT NULL,
  `gallery_4` varchar(255) NOT NULL,
  `gallery_5` varchar(255) NOT NULL,
  `date_time_post` datetime NOT NULL,
  `view_total` int(11) NOT NULL,
  `show_page` enum('0','1') NOT NULL,
  `position` enum('0','1','2','3','4','5') NOT NULL COMMENT 'ตารางเก็บค่าว่าหน้าไหนยุที่เมนูไหน'
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บข้อมูลหน้าเว็บที่สร้างขึ้นเอง';

--
-- Dumping data for table `lp_page`
--

INSERT INTO `lp_page` (`id`, `name_page`, `keyword`, `description`, `detail_page`, `url_link`, `gallery_1`, `gallery_2`, `gallery_3`, `gallery_4`, `gallery_5`, `date_time_post`, `view_total`, `show_page`, `position`) VALUES
(1, 'ทดสอบหน้าเว็บ', 'ทดสอบ keyword', 'ทดสอบ description', '<p>ทดสอบ detail</p>', 'http://demo.lnwphp.in.th/mcuthailand/index.html', '', '', '', '', '', '2015-09-29 11:37:19', 0, '0', '0'),
(2, 'เมนูเว็บที่2', 'เมนูเว็บที่2', 'เมนูเว็บที่2', '<p>เมนูเว็บที่2</p>', '', '', '', '', '', '', '2015-09-30 14:55:37', 0, '0', '0'),
(3, 'หน้าเว็บ', 'หน้าเว็บ', 'หน้าเว็บ', '<p>หน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บหน้าเว็บ</p>', '', '3o20qytapfy8kg0gso.jpg', '2xn93m23lgcgk8k8sc.jpg', '2943xlww76m8c80wk0.jpg', '', '', '2015-10-03 10:52:24', 0, '0', '0'),
(4, 'เพิ่มหน้าเว็บ', 'เพิ่มหน้าเว็บ', 'เพิ่มหน้าเว็บ', '<p>เพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บเพิ่มหน้าเว็บ</p>', '', 'lb1nr4lpw0gck8skg4.jpg', '1csz7f270r0g4kcsc4.jpg', 'adgjwlcu3ncwgg4kc0.jpg', '', '', '2015-10-03 10:53:37', 0, '0', '0'),
(6, 'ทดสอบลิ้งท้ายเว็บ', 'ทดสอบลิ้งท้ายเว็บ', 'ทดสอบลิ้งท้ายเว็บ', '<p>ทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บ</p>', '', '', '', '', '', '', '2015-10-03 19:30:37', 0, '0', '3'),
(7, 'ทดสอบลิ้งท้ายเว็บ', 'ทดสอบลิ้งท้ายเว็บ', 'ทดสอบลิ้งท้ายเว็บ', '<p>ทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บ</p>', '', '', '', '', '', '', '2015-10-03 19:30:51', 0, '0', '4'),
(8, 'ทดสอบลิ้งท้ายเว็บ', 'ทดสอบลิ้งท้ายเว็บ', 'ทดสอบลิ้งท้ายเว็บ', '<p>ทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บทดสอบลิ้งท้ายเว็บ</p>', '', '', '', '', '', '', '2015-10-03 19:31:02', 0, '0', '5');

-- --------------------------------------------------------

--
-- Table structure for table `lp_portfolio`
--

CREATE TABLE IF NOT EXISTS `lp_portfolio` (
  `id` int(11) NOT NULL,
  `name_page` varchar(255) NOT NULL,
  `keyword` text NOT NULL,
  `description` text NOT NULL,
  `detail_page` longtext NOT NULL,
  `gallery_1` varchar(255) NOT NULL,
  `gallery_2` varchar(255) NOT NULL,
  `gallery_3` varchar(255) NOT NULL,
  `gallery_4` varchar(255) NOT NULL,
  `gallery_5` varchar(255) NOT NULL,
  `date_time_post` datetime NOT NULL,
  `view_total` int(11) NOT NULL,
  `show_portfolio` enum('0','1') NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บข้อมูลผลงานของทางเว็บ';

--
-- Dumping data for table `lp_portfolio`
--

INSERT INTO `lp_portfolio` (`id`, `name_page`, `keyword`, `description`, `detail_page`, `gallery_1`, `gallery_2`, `gallery_3`, `gallery_4`, `gallery_5`, `date_time_post`, `view_total`, `show_portfolio`) VALUES
(3, 'หุ่นยนต์ Rubik', 'หุ่นยนต์ Rubik', 'หุ่นยนต์ Rubik', '<p>ใช้หลักการ Image Processing จับตำแหน่ง ของสี่แต่ละตำ่แหน่งว่าเป็นสีอะไร โดยใช้ โปรแกรม Visaul Basic 6 ในการเขียนติดต่อ กล้อง และสั่งงานเซอร์โวมอเตอร์ให้หมุน ตามอัลกอลิทึม</p>', 'oa0uz17fe2sks484s0.jpg', 'tbonwekvo80kwwckkw.jpg', '1nukyxpnb4skkssg0c.jpg', '1lc4ye9jc9fooscswo.jpg', 'qae8ebdae2sgwsosog.jpg', '2015-09-30 16:55:52', 0, '0'),
(4, 'หุ่นยนต์ส่งของ', 'หุ่นยนต์ส่งของ', 'หุ่นยนต์ส่งของ', '<p>หุ่นยนต์ส่งของ เป็นหุ่นยนต์ที่ทำหน้าที่ ในการส่งของไปยังแต่ละจุด โดยแต่ละจุด จะมีชุดตัวส่งสัญญาณ เพื่อบอกตำแหน่ง ที่ต้องการให้หุ่นยนต์เดินไป โดยใช้หลัก การให้ตัวหุ่นยนต์ส่งคำสั่งไปยังชุดบอก ตำแหน่งให้เปิดการทำงาน ผ่านทาง Wire Less เมื่อหุ่นยนต์ตรวจจับสํญญาณ อินฟราเรดที่ส่งมาได้ หุ่นยนต์จะดินไปยัง ตำแหน่งนั้น</p>', 'opme41956rk0o44koc.jpg', 'g02l0mol8w00kkg80k.jpg', 'lm6u5uusips4g0c448.jpg', 'en0slh2lyjkg80ow4c.jpg', '', '2015-09-30 16:54:11', 0, '0'),
(5, 'ชุดบอกเกียร์', 'ชุดบอกเกียร์', 'ชุดบอกเกียร์', '<p>ชุดบอกเกียร์ ใช้ไมโครคอนโทรเลอร์ ตระกูล PIC ในการควบคุมการทำงานทั้งหมด แสดง ผลผ่านบนจอ NOKIA 5110 เป็นภาพเคลื่อน ไหว</p>', 'kbwse93iilw8gs0ks0.jpg', '4qtm83it3r0gsw4o88.jpg', '2p6gwpe5ppmokgkco.jpg', '1xgj32mxdzvo4kgccw.jpg', '', '2015-09-30 16:55:59', 0, '0'),
(6, 'ออมสินลูกหมู', 'ออมสินลูกหมู', 'ออมสินลูกหมู', '<p>ใช้บอร์ด ARM7 เชื่อมต่อจอ Touch Screen แสดงผลจำนวนเงินทั้งหมดและโชว์ชนิดของ เหรียญที่หยอด โดยมีชุดนับเหรียญซึ่งใช้ MCS 51เช็คจำนวนเหรียญและชนิดของเหรียญส่งข้อ มูลผ่าน RS-232 ไปยังบอร์ด ARM7 เพื่อแสดง ผลออกจอ</p>', '13x2emyfix6scgc04c.jpg', '', '', '', '', '2015-09-30 17:30:30', 0, '0'),
(7, 'ควบคุมการทำงานด้วยจอ Touch Screen', 'ควบคุมการทำงานด้วยจอ Touch Screen', 'ควบคุมการทำงานด้วยจอ Touch Screen', '<p>ใช้ AVR MEGA128 ในการสั่งงานจอ Touch Screen โดยเชื่อมต่อในโหมด 16 BIT สามารถ สั่งงานผ่านทางจอได้เลย และแสดงผลผ่านจอ Touch Screen</p>', '2yxbh77pwwu8ckkocs.jpg', '', '', '', '', '2015-09-30 17:31:09', 0, '0'),
(8, 'เครื่องอบข้าวด้วยไมโครเวฟ', 'เครื่องอบข้าวด้วยไมโครเวฟ', 'เครื่องอบข้าวด้วยไมโครเวฟ', 'ใช้ไมโครเวฟในการอบข้าวเพื่อไล่ความชื้นของ\nข้าวให้อยู่ในระดับที่เหมาะสม โดยใช้้ไมโครคอน โทรลเลอร์ ตระกูล MCS-51 ในการควบคุมการ ทำงานทั้งหมดและมีเซนเซอร์วัดความชื้นขณะ\nอบข้าว โดยแสดงผลการทำงานผ่านจอ LCD', 's1evwjdgcu80gg8ko8.jpg', '', '', '', '', '2015-09-30 17:31:48', 0, '0'),
(9, 'คีย์แพด Mtouch ขนาด 3x4', 'คีย์แพด Mtouch ขนาด 3x4', 'คีย์แพด Mtouch ขนาด 3x4', 'เป็นคีย์แพดขนาด 3x4 ใช้ไมโครคอนโทรลเลอร์ ตระกูล PIC เบอร์ 16F727 โดยส่งค่าการกดผ่านทาง RS-232', '5zkkkz87nxgk004ww0.jpg', '', '', '', '', '0000-00-00 00:00:00', 0, '0'),
(10, 'เครื่องวัดระยะทาง 8 ช่อง', 'เครื่องวัดระยะทาง 8 ช่อง', 'เครื่องวัดระยะทาง 8 ช่อง', '<p>เครื่องวัดระยะทาง 8 ช่อง ใช้ไมโครคอนโทรลเลอร์ ตระกูล PIC ควบคุมการทำงานทั้งหมด โดยมีเซน เซอร์อินฟราเรทวัดระยะทางส่งข้อมูลแบบ Analog แสดงผลการทำงานผ่านจอ LCD 20x4 และมีสวิตซ์ สำหรับตั้งค่าและเลื่อนดูระยะทางที่อ่านได้</p>', '2theng2f86skccc4sg.jpg', '', '', '', '', '2015-09-30 17:32:49', 0, '0'),
(11, 'สั่งงานรีเลย์ 4 ช่อง ด้วยรีโมท SONY', 'สั่งงานรีเลย์ 4 ช่อง ด้วยรีโมท SONY', 'สั่งงานรีเลย์ 4 ช่อง ด้วยรีโมท SONY', 'บอร์ดสั่งงานรีเลย์ 4 ช่อง ด้วยรีโมท SONY เป็น\nโครงงานที่ได้เคยทำไว้ใช้งานเอง โดยใช้ไมโคร\nคอนโทรลเลอร์ ตระกูล PIC รับค่าจากโมดูลอินฟรา เรทแล้วทำการถอดรหัสข้อมูล โปรโตคอลในการรับ ส่งข้อมูลสามารถค้นหาใน Google ได้ครับ ส่วนของ โมดูลอินฟราเรทมีขายในท้องตลาดครับ', 'hhxpiu5pfpc0ockg80.jpg', '', '', '', '', '2015-09-30 17:33:17', 0, '0'),
(12, 'รีโมทควบคุมคอมพิวเตอร์', 'รีโมทควบคุมคอมพิวเตอร์', 'รีโมทควบคุมคอมพิวเตอร์', 'รีโมทควบคุมคอมพิวเตอร์ โดยใช้ไมโครคอนโทรล เลอร์ ตระกูล MCS-51 ในการรับข้อมูลที่ส่งมาทาง อินฟราเรทแล้วทำการถอดรหัสข้อมูลที่ส่งมา หลัง\nจากนั้นจะให้ MCS-51 จำลองคีย์บอร์ดโดยส่งข้อมูล\nไปยังคอมพิวเตอร์ เพื่อควบคุมคอมพิวเตอร์ในการ\nShut Down เครื่อง หรือเปิดโปรแกรมต่างๆ', '7kmbhohn2k8w44cso4.jpg', '', '', '', '', '2015-09-30 17:33:50', 0, '0'),
(13, 'Fight Sim', 'Fight Sim', 'Fight Sim', 'Fight Sim เป็นผลงานชิ้นหนึ่งที่ได้ทำมา โดยใช้โป แกรมจำลองการบิน ลิงค์กับชุดคอนโทรลตัวเครื่อง จำลองการบิน ตัวโครงเครื่องบินจะประกอบไปด้วย เหล็กและไฟเบอร์กราส ภายในมีคันโยกควบคุมทิศ ทางของเครื่องบินและแสดงภาพบนจอมอนิเตอร์', 'x9n1mn3pc2okwokwk.jpg', '', '', '', '', '2015-09-30 17:34:21', 0, '0');

-- --------------------------------------------------------

--
-- Table structure for table `lp_setting`
--

CREATE TABLE IF NOT EXISTS `lp_setting` (
  `id` int(11) NOT NULL,
  `name_website` varchar(255) NOT NULL,
  `url_web` varchar(255) NOT NULL,
  `keyword` text NOT NULL,
  `description` text NOT NULL,
  `facebook_url` text NOT NULL,
  `code_stat` text NOT NULL,
  `dbd_code` text NOT NULL,
  `address_1` varchar(255) NOT NULL,
  `address_2` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `tel` varchar(13) NOT NULL,
  `name_owner` varchar(255) NOT NULL,
  `logo_website` varchar(255) NOT NULL,
  `background_image` varchar(255) NOT NULL COMMENT 'เก็บชื่อภาพพื้นหลังเว็บ',
  `cache` enum('0','1') NOT NULL,
  `cache_time` varchar(50) NOT NULL,
  `prefix_cache` varchar(50) NOT NULL,
  `map_to_mcu` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บการตั้งค่าต่างๆของเว็บ';

--
-- Dumping data for table `lp_setting`
--

INSERT INTO `lp_setting` (`id`, `name_website`, `url_web`, `keyword`, `description`, `facebook_url`, `code_stat`, `dbd_code`, `address_1`, `address_2`, `email`, `tel`, `name_owner`, `logo_website`, `background_image`, `cache`, `cache_time`, `prefix_cache`, `map_to_mcu`) VALUES
(1, 'ยินดีตอนรับสู่ all-mcuprojects รับทำงานด้านอิเล็กทรอนิกส์ต่าง ๆ', 'http://demo.lnwphp.in.th/mcuthailand/', 'หุ่นยนต์ Rubik,ออมสินลูกหมู,ควบคุมการทำงานด้วยจอ Touch Screen,เครื่องอบข้าวด้วยไมโครเวฟ,คีย์แพด Mtouch ขนาด 3x4', 'รับทำโปรเจคนักศึกษาครับ ราคาไม่แพงครับ เมื่อ\nงานเสร็จจะมีการสอนการทำงานของโปรแกรมแบบ\nละเอียดครับ พร้อมกับข้อมูลของโปรเจคนั้นให้ครับ\nเพื่อสะดวกในการจัดทำรูปเล่ม โดยพัฒนาด้วยไม\nโครคอนโทรลเลอร์ ตระกูล MCS-51, AVR, PIC,\nARM และงานด้านฐานข้อมูลใช้ Visaul Basic 6 \nเช่น ระบบจอดรถด้วย RFID โดยเก็บข้อมูลลงฐาน\nข้อมูล ระบบเข้าออกสแกนลายนิ้วมือ ด้วย Finger print เก็บข้อมูลพนักงานลงฐานข้อมูล เป็นต้น', 'https://www.facebook.com/รับออกแบบ-รับทำโปรเจค-ไมโครคอนโทรลเลอร์-จำหน่ายสินค้าอิเล็กทรอนิกส์-128850330612747', '<img src="http://cc.amazingcounters.com/counter.php?i=3077710&c=9233443" alt="Babiesrus Coupons" border="0" align="absmiddle">', 'DBD CODE', 'หมู่บ้านบุญฑริก บ้านเลขที่ 48/71', 'ตำบลลาดสวาย อำเภอลำลูกกา จังหวัดปทุมธานี 12150', 'all-mcuprojects@hotmail.com', '083-8224023', 'คุณ อภิชาติ', 'logo.png', '1wlrfrbsb8qsk0k8co.jpg', '0', '6000', 'mcu_', '13.9328092,100.68670220000001');

-- --------------------------------------------------------

--
-- Table structure for table `lp_slideshow`
--

CREATE TABLE IF NOT EXISTS `lp_slideshow` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `images` varchar(255) NOT NULL,
  `show_slide` enum('0','1') NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บภาพสไลต์สำหรับโปรโมทต่างๆในเว็บ';

--
-- Dumping data for table `lp_slideshow`
--

INSERT INTO `lp_slideshow` (`id`, `name`, `images`, `show_slide`) VALUES
(1, 'ทดสอบภาพสไลต์', 'q3l9k7ve99ck4soc4.jpg', '0'),
(2, 'test2', '2nv1ac6l7iuc0sg8g8.jpg', '0'),
(3, 'test3', 'vwm26r53y6sokc0kc4.jpg', '0'),
(4, 'test4', 'f8gd4e0ooxwgsc4s4.jpg', '0');

-- --------------------------------------------------------

--
-- Table structure for table `lp_user`
--

CREATE TABLE IF NOT EXISTS `lp_user` (
  `id` int(11) NOT NULL,
  `avatar` varchar(255) NOT NULL COMMENT 'เก็บรุปส่วนตัวของผู้ใช่งาน',
  `firstname` varchar(255) NOT NULL,
  `lastname` varchar(255) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL COMMENT 'เก็บรหัสผ่านของผู้ใช่งานแบบ MD5',
  `email` varchar(255) NOT NULL,
  `jointdate` datetime NOT NULL,
  `staus` enum('User','Admin') NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บข้อมูลผู้ใช่งานเว็บ';

--
-- Dumping data for table `lp_user`
--

INSERT INTO `lp_user` (`id`, `avatar`, `firstname`, `lastname`, `username`, `password`, `email`, `jointdate`, `staus`) VALUES
(1, '1t5aj1y2ti5cgwc8og.jpg', 'ธนชิต', 'สิทธิกัน', 'admin', '12345678', 'benzbenz900@gmail.com', '2015-10-03 12:07:09', 'Admin');

-- --------------------------------------------------------

--
-- Table structure for table `lp_videos`
--

CREATE TABLE IF NOT EXISTS `lp_videos` (
  `id` int(11) NOT NULL,
  `name_video` varchar(255) NOT NULL,
  `keyword` text NOT NULL,
  `description` text NOT NULL,
  `detail_video` longtext NOT NULL,
  `youtube_link` varchar(255) NOT NULL,
  `date_time_post` datetime NOT NULL,
  `view_total` int(11) NOT NULL,
  `show_video` enum('0','1') NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บผลงานที่เป็นวิดีโออัพไฟล์ลง youtube';

--
-- Dumping data for table `lp_videos`
--

INSERT INTO `lp_videos` (`id`, `name_video`, `keyword`, `description`, `detail_video`, `youtube_link`, `date_time_post`, `view_total`, `show_video`) VALUES
(2, 'เครื่องนำเสนอข้อมูล', 'เครื่องนำเสนอข้อมูล', 'เครื่องนำเสนอข้อมูล', '<p>ใช้ไมโครคอนโทรลเลอร์ ATMEGA128 รันที่ความถี่ 16 MHz อ่านไฟล์ภาพ .BMP และไฟล์เสียง .MP3 แสดงผลผ่านจอ Touch Screen สามารถปรับเปลี่ยนเสียงบรรยายผ่าน Touch Screen และมีโมดูล RFID สำหรับอ่าน RFID Card การทำงานของเเครื่อง คือ เป็นเครื่องนำเสนอข้อมูลของชิ้นงาน แต่ละชิ้นงานจะมีการ์ด RFID ติดอยู่ เมื่อนำเครื่องไปแตะบริเวณการ์ด เครื่องจะทำการตรวจสอบ ID เพื่อบรรยายรายละเอียดของชิ้นงานนั้น</p>', 'https://www.youtube.com/watch?v=xNhPuF3WYx8', '2015-09-30 18:39:11', 0, '0'),
(3, 'ทดลองการควบคุมหลอด LED', 'ทดลองการควบคุมหลอด LED', 'ทดลองการควบคุมหลอด LED', 'ทดลองการควบคุมหลอด LED ซึ่งใช้ไฟ AC 220 โวลต์ แปลงเป็นไฟ DC โดยวงจรแปลงไฟใช้ DIODE ต่อเป็นวงจร Bridge Rectifier และใช้วงจร Zerro Crossing ตรวจจับมุม 0 ของ Sin ทีถูกแปลงเป็น Full Wave แล้ว ซึ่งใช้ไมโครคอนโทรลเลอร์ 16F887 ควบคุมการทำงานของวงจร การทำงานของโปรแกรมคือ ตรวจจับ Zerro Crossing แล้วสั่งทริก Traiac ที่มุมที่ต้องการ และใช้ VR เป็นตัวเลือกมุนที่จะทริก Triac', 'https://www.youtube.com/watch?v=u5rAFqi2_Ic', '2015-09-30 18:55:41', 0, '0'),
(4, 'เครื่องวัดอุณหภูมิและความชื้น', 'เครื่องวัดอุณหภูมิและความชื้น', 'เครื่องวัดอุณหภูมิและความชื้น', '<p>เครื่องวัดอุณหภูมิและความชื้น ใช้ไมโครคอนโทรลเลอร์ PIC16F877 เชื่อมต่อกับ SHT15 ผ่านระบบบัส I2C แสดงผลอุณหภูมิผ่านจอ LCD 16 x 2 การทำงานของเครื่อง คือ เป็นเครื่องควบคุมความเย็นของตู้ทำความเย็น เครื่องสามารถปรับลดอุณหภูมิได้ ผ่านทางปุ่ม Enter, Up และ Down</p>', 'https://www.youtube.com/watch?v=xmrwwSwFqfU', '2015-09-30 18:56:54', 0, '0'),
(5, 'ทดสอบหุ่นยนต์ไต่ผนัง', 'ทดสอบหุ่นยนต์ไต่ผนัง', 'ทดสอบหุ่นยนต์ไต่ผนัง', '<p>ทดสอบหุ่นยนต์ไต่ผนัง ตัวชุดคอนโทรลใช้ไมโครคอนโทรลเลอร์ PIC16F887 ส่วนชุดขับเคลื่อนใช้เซอร์โวมอเตอร์ ซึ่งดัดแปลงให้สามารถหมุนได้ 360 องศา พัดลมดูดอากาศควบคุมด้วยมอสเฟตและใช้งานโ มดูล PWM ควบคุมความเร็ว ตัวโครงหุ่นยนต์ทำด้วยแผ่นอคิลิกหน้า 2 mm ความคุมผ่านทาง Wire less ใช้โมดูล X-Bee เชื่อมต่อกันระหว่างหุ่นยนต์กับคอมพิวเตอร์</p>', 'https://www.youtube.com/watch?v=ATrioBM1I8k', '2015-09-30 18:57:04', 0, '0'),
(6, 'ชุดบอกเกียร์', 'ชุดบอกเกียร์', 'ชุดบอกเกียร์', 'ชุดบอกเกียร์\n     ใช้ไมโครคอนโทรลเลอร์ PIC18F452 ทำงานที่ความถี่ 20 MHz เชื่ิอมต่อกับจอ \nNOKIA 5110 ผ่านระบบบัส SPI ใช้ชุดบอกเกียร์ส่งสัญญาณมาบอกไมโคร\nคอนโทรลเลอร์ \n     การทำงานของเครื่องจะอ่านเซนเซอร์บอก\nเกียร์ และแสดงเกียร์เป็นรูปภาพและตัวเลขบนจอ รูปภาพแต่ละรูปจะถูกเก็บในหน่วยความจำของ\nไมโครคอนโทรลเลอร์ สามารถปรับเปลี่ยนรูปภาพได้', 'https://www.youtube.com/watch?v=S8JnRRl3084', '2015-09-30 18:58:11', 0, '0'),
(7, 'เครื่องแสดงการทำงานของ INTERCOM', 'เครื่องแสดงการทำงานของ INTERCOM', 'เครื่องแสดงการทำงานของ INTERCOM', 'เครื่องแสดงการทำงานของ INTERCOM\n     การทำงานจะทำหน้าที่แสดงผลการทำงานของระบบชุมสายภายใน\nโดยใช้ไมโครคอนโทรลเลอร์ ตรวจจับสัญญาณต่างๆ ที่ส่งมาจากตู้ชุม\nสาย ได้แก่ สัญญาณ Ringing Tone, สัญญาณ Dial Tone ยกสาย และ\nการวางสาย เมื่อจับสัญญาณต่างๆ ได้แล้ว จะทำการแสดงผลผ่านทาง\nจอ LCD ขนาด 20 อักษร x 4 บรรทัด \n     ภายในตัวชุดคอนโทรลใช้ไมโครคอนโทรลเลอร์ เบอร์ PIC16F1939\nควบคุมการทำงานทั้งหมด โดยใช้่ขาอินเตอร์รัพท์ INT0 สำหรับจับสัญ\nญาณต่างๆ และใช้ขา A0 สำหรับตรวจจับแรงดันของการยกสายวาง\nสาย', 'https://www.youtube.com/watch?v=uRagowEA7n0', '2015-09-30 18:58:35', 0, '0'),
(8, 'ทดลอง PID Control', 'ทดลอง PID Control', 'ทดลอง PID Control', 'ทดลอง PID Control\n     สำหรับการทดลองนี้ ผมทำการทำลองการใช้ PID เพื่อควบคุมแรงดันเอาต์พุต โดยใช้ไมโครคอนโทรลเลอร์ PIC16F877 ทำงานที่ความถี่ 20 MHZ และใช้งานโมดูล PWM ภายในขนาด 10 บิต ขับชุดทรานซิสเตอร์เพื่อควบุมแรงดันที่จ่ายออก\nไปยังเอาต์พุต โดยมีแรงดัน Feedback กลับไปยังไมโคร ซึ่งผมใช้โมดูล ADC ทำหน้าที่แปลงแรงดัน อนาลอกให้เป็นดิจิตอล แล้วนำค่าที่อ่านได้นี้ไปประมวลผลหาค่า duty ที่จะจ่ายไปยังทรานซิสเตอร์ โดยการประมวลผลแต่ละครั้งจะสุ่มทำทุกๆ 10 ms ค่าพารามิเตอร์ต่า่งๆ ที่คำนวณได้จะส่งไปแสดงยังคอมพิวเตอร์\nผ่านทางโปรแกรม VB6 ที่เขียนไว้', 'https://www.youtube.com/watch?v=vBUP_UapOok', '2015-09-30 18:58:59', 0, '0'),
(9, 'สร้าง Oscilloscope ด้วยไมโครคอนโทรลเลอร์ ATMEGA128', 'สร้าง Oscilloscope ด้วยไมโครคอนโทรลเลอร์ ATMEGA128', 'สร้าง Oscilloscope ด้วยไมโครคอนโทรลเลอร์ ATMEGA128', 'สร้าง Oscilloscope ด้วยไมโครคอนโทรลเลอร์ ATMEGA128 \nการทำงานของโปรแกรม จะรับค่า ADC ที่ขา PORTF.0 ซึ่งเป็นขา ADC ช่องที่ 0 เมื่ออ่านค่า ADC ได้แล้ว จะนำค่านี้แปลงออกเป็นดิจิตอล แล้วนำไป plot ที่แกน y (แกนแนวตั้ง) ส่วนแกน X (แกนแนวนอน) จะเป็นแกนของเวลา ตัวไมโครคอนโทรลเลอร์จะติดต่อกับจอ Touch Screen แบบขนาน ซึ่งรับส่งข้อมูลครั้งละ 8 บิต ส่วนของตัว Touch จะเชื่อมต่อผ่านทางระบบ SPI', 'https://www.youtube.com/watch?v=ofht9DADIG8', '2015-09-30 18:59:32', 0, '0'),
(10, 'เครื่องป้องกันภัยภายในบ้าน', 'เครื่องป้องกันภัยภายในบ้าน', 'เครื่องป้องกันภัยภายในบ้าน', '<p>เครื่องป้องกันภัยภายในบ้าน บอร์ดมาสเตอร์ใช้ไมโครคอนโทรลเลอร์ เบอร์ AT89C51AC3 เชื่อมต่อกับบอร์ดสเลฟ ใช้ไมโครคอนโทรลเลอร์เบอร์ AT89C2051 เชื่อมต่อกันผ่านทาง TRW 2.4 GHz ซึ่งเป็นชุด โมดูลแบบ Wireless สามารถเลือกช่องสัญญาณ ได้ การทำงานตัวมาสเตอร์จะคอยส่งคำสั่งไป ถามสถานะของตัวสเลฟ หากไม่มีการส่งสถานะ กลับมาตัวมาสเตอร์จะแสดงสถานะว่า ไม่มีการ เชื่อมต่อ แต่ถ้ามีก็จะแสดงสถานะนั้น ผ่านจอ LCD ขนาด 20 x 4 และมีคีย์แพทสำหรับ การเลือกดูสถานนะของเซนเซอร์แต่ละบอร์ดได้ และยังสามารถที่จะกำหนดการทำงานต่างๆ ของเซนเซอร์ได้</p>', 'https://www.youtube.com/watch?v=wmYpI4V315I', '2015-09-30 18:59:58', 0, '0'),
(11, 'การเขียนโปรแกรม เพื่ออ่านค่าจาก ID12', 'การเขียนโปรแกรม เพื่ออ่านค่าจาก ID12', 'การเขียนโปรแกรม เพื่ออ่านค่าจาก ID12', 'การเขียนโปรแกรม เพื่ออ่านค่าจาก ID12 ใช้ไมโครคอนโทรลเลอร์ MCS-51 เบอร์ AT89C51AC3 อ่าน ID12 จำนวน 4 ชุด โดยการเขียน\nจำลองการทำงานของโมดูล UART จำนวน 4 ชุด เพื่อรับค่าจาก ID12 \n     ในเบอร์ AT89C51AC3 จะมีโมดูล UART ให้ใช้งานได้เพียง 1 ช่อง\nการเขียนโปรแกรมจำลองจะช่วยให้สามารถใช้ไมโครที่มีอยู่ UART เพียง 1 ช่องติดต่อกับอุปกรณ์ที่เชื่อมต่อกับ UART ได้หลายๆ ตัว', 'https://www.youtube.com/watch?v=nhXdiyPumKw', '2015-09-30 19:00:32', 0, '0'),
(12, 'ทดลองการเชื่อมต่อระหว่างไมโครคอน โทรลเลอร์ 16F877 กับเซนเซอร์เมาส์ MX8620', 'ทดลองการเชื่อมต่อระหว่างไมโครคอน\nโทรลเลอร์ 16F877 กับเซนเซอร์เมาส์ MX8620', 'ทดลองการเชื่อมต่อระหว่างไมโครคอน\nโทรลเลอร์ 16F877 กับเซนเซอร์เมาส์ MX8620', '<p>ทดลองการเชื่อมต่อระหว่างไมโครคอน โทรลเลอร์ 16F877 กับเซนเซอร์เมาส์ MX8620 ไมโครคอนโทรลเลอร์เชื่อมต่อกับเซนเซอร์ เมาส์ด้วยการส่งข้อมูลแบบอนุกรม ใช้สายสัญ ญาญ 2 เส้น ได้แก่ SCK และ SDIO ค่าที่อ่านได้ คือค่าของตำแหน่ง X และ Y ที่เมาส์เคลื่อนไป ค่า X และ Y จะถูกนำมาคำนวณเป็นระยะทาง สามารถนำไปประยุกต์ในการใช้วัดระยะทางของ แผนที่ได้</p>', 'https://www.youtube.com/watch?v=ToYv3uM_U8M', '2015-09-30 19:00:57', 0, '0');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `lp_ads`
--
ALTER TABLE `lp_ads`
  ADD PRIMARY KEY (`id`) COMMENT 'ตั้งให้เป็น Key หลักสำหรับเรียกข้อมูล';

--
-- Indexes for table `lp_event`
--
ALTER TABLE `lp_event`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lp_mail`
--
ALTER TABLE `lp_mail`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lp_news`
--
ALTER TABLE `lp_news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lp_page`
--
ALTER TABLE `lp_page`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lp_portfolio`
--
ALTER TABLE `lp_portfolio`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lp_setting`
--
ALTER TABLE `lp_setting`
  ADD PRIMARY KEY (`id`), ADD KEY `id` (`id`), ADD KEY `setting` (`id`);

--
-- Indexes for table `lp_slideshow`
--
ALTER TABLE `lp_slideshow`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lp_user`
--
ALTER TABLE `lp_user`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lp_videos`
--
ALTER TABLE `lp_videos`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `lp_ads`
--
ALTER TABLE `lp_ads`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id เก็บลำดับการเพิ่มข้อมูล',AUTO_INCREMENT=13;
--
-- AUTO_INCREMENT for table `lp_event`
--
ALTER TABLE `lp_event`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'เก็บลำดับการเพิ่่มข้อมูล',AUTO_INCREMENT=10;
--
-- AUTO_INCREMENT for table `lp_mail`
--
ALTER TABLE `lp_mail`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT for table `lp_news`
--
ALTER TABLE `lp_news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT for table `lp_page`
--
ALTER TABLE `lp_page`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=9;
--
-- AUTO_INCREMENT for table `lp_portfolio`
--
ALTER TABLE `lp_portfolio`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=14;
--
-- AUTO_INCREMENT for table `lp_setting`
--
ALTER TABLE `lp_setting`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `lp_slideshow`
--
ALTER TABLE `lp_slideshow`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `lp_user`
--
ALTER TABLE `lp_user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `lp_videos`
--
ALTER TABLE `lp_videos`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=13;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
